## Part I. 파이썬 소개

### <u> 1. 파이썬을 쓰는 이유 (엑셀 프로그래밍의 한계) </u>
- Excel도 프로그래밍이 가능하지만, SW 개발규칙을 준수하는 경우가 거의 없다. 
1) 동일 시트안에 입력/계산/출력 혼재
2) 정상 작동위한 조건이 불명확 
3) 코드(중요 요소) 수정시 안전조치 부재 
4) 매뉴얼, 테스트 부재 다수 
5) 기타 : 버전관리 어려움, 리눅스 등 서버환경 지원 미흡 등 

- ex> '20년 영국 코로나 검사 결과 지연 사고 : 최대 65,000행망 지원하는 구형버전 엑셀 사용으로, 약 16천건의 검사 데이터가 소실되었음을 뒤늦게 알아차림 
- ex> 미국 모 유전자 연구소 사고 : 엑셀로 실험결과를 주고받는 과정에서, 유전자 이름 "March-1" 을 엑셀이 날짜로 인식하여 "1-Mar"로 변경함

### <u> 2. text와 변수를 함께 사용하려면, f_를 사용한다. </u>
- text 앞에 f, 변수는 중괄호로

In [9]:
x1, x2 = 'free', 'open_source'

f"Python is {x1} and {x2}."

'Python is free and open_source.'

### <u> 3. Index에서 slice를 활용하여 문자열의 특정부분만 추출하기 </u>

In [14]:
txt = "Python"

t1 = txt[-3:]
t2 = txt[-3:][1]
t3 = txt[-3:][1:]

print(t1)
print(t2)
print(t3)

hon
o
on

### <u> 4. 리스트에서 slice 사용하여 특정값 추출하기 </u>

In [16]:
cell = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

In [17]:
cell[1]

[4, 5, 6]

In [18]:
cell[1][1:]

[5, 6]

 ### <u> 5. 리스트에 요소 추가 및 제거 </u>

In [31]:
users = ['Linda', 'Brian']

In [34]:
users.append('Jennifer')  ## 맨뒤 추가 
users

['Linda', 'Brian', 'Jennifer', 'Jennifer']

In [35]:
users.insert(0, 'Kim')  ## 지정위치 삽입 
users

['Kim', 'Linda', 'Brian', 'Jennifer', 'Jennifer']

In [36]:
del users[0]  ## 지정위치 삭제  
users

['Linda', 'Brian', 'Jennifer', 'Jennifer']

### <u> 6. 딕셔너리를 병합할때는   |   를 사용한다. </u>

In [37]:
ex_rate_1 = {'EUR : 1.1152', 
             'GBP : 1.2454', 
             'AUD : 0.6161'     
}


ex_rate_2 = {'SGD : 0.7004', 
             'GBP : 1.2222'     
}

In [38]:
ex_rate_1 | ex_rate_2    ## GBP : 1.2454  ---> GBP : 1.2222 로 업데이트 되었다.

{'AUD : 0.6161',
 'EUR : 1.1152',
 'GBP : 1.2222',
 'GBP : 1.2454',
 'SGD : 0.7004'}

### <u> 7. 파이썬 코드 스타일 </u>
- 단순한 if문에는 괄호를 쓰지 않는다. 
- 값이 True인지는 명시적 확인이 불필요 하다.

In [42]:
x1 = True 

if x1 :  ## if x1 == True 
    print ('This is important.')
else :
    print ('This is not important.')

This is important.

In [47]:
x2 = []

if x2 :   ## if len(x) > 0 
    print (f'The values are {x2}.')
else : 
    print (f'There are no values.')

There are no values.

### <u> 8. 화씨, 켈빈 온도를 섭씨온도로 변환하는 함수 만들어 사용하기  </u>

In [48]:
def convert_to_cel (degrees, source) : 
    if source.lower() == 'farenheit': 
        return (degrees - 32)*(5/9)
    elif source.lower() == 'kelvin' : 
        return (degrees - 273.15) 
    else : 
        return f'Dont know how to convert from {soruce}.'

In [49]:
convert_to_cel(100, 'Farenheit')

37.77777777777778

In [50]:
convert_to_cel(0, 'kelvin')

-273.15

In [51]:
##########################################################################################################################

## Part II. Numpy, Pandas 소개

In [52]:
import math 
import numpy as np 
import pandas as pd

In [54]:
arrary_1 = np.array([[1,2,3], 
                     [4,5,6]])

arrary_1

array([[1, 2, 3],
       [4, 5, 6]])

### <u> 1. 일반적인(math의) 수학연산자는 행렬에 적용하기 어렵다. </u>
- ex. > math.sqrt(array_1) => error

In [55]:
np.sqrt(arrary_1)

array([[1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974]])

### <u> 2. dataframe의 정렬 (sort) </u>

In [59]:
df = pd.read_excel("python-for-excel-1st-edition/xl/course_participants.xlsx")
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [60]:
## default index를 user_id로 변경
df.reset_index().set_index('user_id')

         index   name  age  country  score continent
user_id
1001         0   Mark   55    Italy    4.5    Europe
1000         1   John   33      USA    6.7   America
1002         2    Tim   41      USA    3.9   America
1003         3  Jenny   12  Germany    9.0    Europe

In [61]:
df.sort_index()  ## 인덱스 기준으로 정렬

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [63]:
df.sort_values("continent")   ## 변수 기준으로 정렬

   user_id   name  age  country  score continent
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
0     1001   Mark   55    Italy    4.5    Europe
3     1003  Jenny   12  Germany    9.0    Europe

In [64]:
df.sort_values(["continent", "country"])   ## 복수의 변수 기준으로 정렬

   user_id   name  age  country  score continent
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe
0     1001   Mark   55    Italy    4.5    Europe

### 3. 데이터 프레임의 일부분을 추출할때 (loc vs. iloc) 
- loc : 컬럼명을 사용
- iloc : 행과 열의 순서(슬라이스)를 사용

In [67]:
df.loc[:, 'country']   ## row는 전체,col은 country열만 추출

0      Italy
1        USA
2        USA
3    Germany
Name: country, dtype: object

In [68]:
df.loc[:, ['country', 'age']]

   country  age
0    Italy   55
1      USA   33
2      USA   41
3  Germany   12

In [69]:
df.iloc[:, 2]

0    55
1    33
2    41
3    12
Name: age, dtype: int64

In [71]:
df.iloc[:, [1,3]]

    name  country
0   Mark    Italy
1   John      USA
2    Tim      USA
3  Jenny  Germany

In [72]:
df.iloc[:, :3]

   user_id   name  age
0     1001   Mark   55
1     1000   John   33
2     1002    Tim   41
3     1003  Jenny   12

### <u> 4. 문자열 다루기 </u>

In [73]:
users = pd.DataFrame(data=[" mArk ", "JOHN  ", "Tim", " jenny"],
                     columns=["name"])
users

     name
0   mArk
1  JOHN
2     Tim
3   jenny

In [77]:
## 문자열의 공백을 제거하고, 첫글자만 대문자로 변환하라. 
users.loc[:, 'name'].str.strip().str.capitalize()

0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

In [86]:
## 대문자 또는 소문자로 변환할때 
print(users.loc[:, 'name'].str.strip().str.upper())
print('---------------------------------------------')
print(users.loc[:, 'name'].str.strip().str.lower())

0     MARK
1     JOHN
2      TIM
3    JENNY
Name: name, dtype: object
---------------------------------------------
0     mark
1     john
2      tim
3    jenny
Name: name, dtype: object

### <u> 5. 데이터프레임 합치기 (concat, join, merge) </u>

1) pd.concat([df1, df2, df3])  : 단순히 합칩때는 concat 

2) df1.join(df2, how = 'inner') 
   df1.join(df2, how = 'left')  : *inner, outer, left, right 조인  
   
3) df1.merge(df2, how = 'left', on = ['category'])  
*join은 인덱스를 기준으로 병합을 실행하나, merge는 병합기준을 on 옵션에서 지정해 주어야 한다.